wstars1994/nes-simulator/nes_c_stm32/Core/Src/nes.c
void ams_immed(byte *reg){
    *reg = read_program(prgPc++);
}

int ams_abs() {
    byte low = read_program(prgPc++);
    byte high = read_program(prgPc++);
    return concat16(low,high);
}

int ams_abs_x(byte reg){
    return ams_abs() + (reg & 0xff);
}

int ams_zero(byte addr,byte reg) {
    return (addr&0XFF) + (reg & 0xff);
}

void ams_adc(byte data){
    int abs_data = (c_reg_a & 0xff) + (data & 0xff) + (flag_c & 0xff);
    flag_c = abs_data >> 8;
    set_nz(abs_data & 0xff);
    flag_v = ((c_reg_a ^ data) & 0x80) == 0 && ((c_reg_a ^ abs_data) & 0x80) != 0;
    c_reg_a = abs_data&0xff;
}

void ams_sbc(byte data){
    int abs_data = (c_reg_a & 0xff) - (data&0xff) - (flag_c == 0 );
    flag_c = (abs_data & 0xff00) == 0;
    set_nz(abs_data&0xff);
    set_v((((c_reg_a ^ data) & 0x80) != 0)&& ((c_reg_a ^ abs_data) & 0x80) != 0);
    c_reg_a = abs_data&0xff;
}

void ams_cmp(byte data){
    short cmpData = (short) ((c_reg_a & 0xff) - (data & 0xff));
    flag_n = (cmpData >> 7) & 1;
    set_z(cmpData&0xFF);
    flag_c = (cmpData & 0xff00) == 0 ? 1 : 0;
}

byte st_x(int addr,byte reg){
    write(addr, reg);
    return 3;
}

int indirect(){
    byte data = read_program(prgPc++);
    byte r1 = read(data&0xff);
    byte r2 = read((data&0xff)+1);
    return concat16(r1,r2);
}

byte indirect_y(){
    return read(indirect() + (c_reg_y & 0xFF));
}
byte indirect_x(){
    byte data = read_program(prgPc++);
    byte addr = (data & 0xFF) + (c_reg_x & 0xFF);
    return read(concat16(read(data), read(addr + 1)));
}

void ams_and(byte data){
    c_reg_a &= data;
    set_nz(c_reg_a);
}

void ams_eor_a(byte data){
    c_reg_a ^= data;
    set_nz(c_reg_a);
}

void ams_ora(byte data){
    c_reg_a |= data;
    set_nz(c_reg_a);
}

void ams_cpy(byte data){
    short cmpData = (short) ((c_reg_y&0xFF) - (data&0xFF));
    set_nz(cmpData);
    flag_c = (cmpData & 0xff00) == 0;
}

void ams_lda(byte data){
    set_nz(data);
    c_reg_a = data;
}

void ams_ror(int addr) {
    byte data = read(addr);
    byte read2 = ((data & 0xff) >> 1) | (flag_c << 7);
    flag_c = data&1;
    set_nz(read2);
    write(addr,read2);
}

void ams_rol(int addr) {
    byte data = read(addr);
    byte read2 = ((data & 0xff) << 1) | flag_c;
    flag_c = (data>>7)&1;
    set_nz(read2);
    write(addr,read2);
}

void ams_asl(int addr){
    byte data = read(addr);
    flag_c=(data >> 7) & 1;
    byte data2 = data << 1;
    set_nz(data2);
    write(addr, data2);
}

void ams_cpx(byte data){
    //TODO 可能有问题
    byte cmpData = c_reg_x - data;
    set_nz(cmpData);
    flag_c = (cmpData & 0xff00) == 0?1:0;
}

void ams_lsr(int addr){
    byte data = read(addr);
    flag_c = data&1;
    byte data2 = (data & 0xff) >> 1;
    set_nz(data2);
    write(addr,data2);
}

//栈操作----------------------------------
void push_stack(byte data){
    write(0x0100 | (c_reg_s&0xFF),data);
    c_reg_s-=1;
}

void push16_stack(short data){
    push_stack((data>>8)&0xFF);
    push_stack(data&0xFF);
}

byte pop8_stack(){
    c_reg_s++;
    return read(0x0100 | (c_reg_s & 0xFF));
}

int pop16_stack(){
    short pcLow8 = (short) (pop8_stack()&0xFF);
    short pcLow16 = (short) (pop8_stack()&0xFF);
    return  (pcLow16 << 8) | pcLow8;
}

byte flag_merge() {
    return (flag_n << 7) | (flag_v << 6) | 0x20 | (flag_b << 4)| (flag_d << 3) | (flag_i << 2) | (flag_z << 1) | flag_c;
}
void flag_set(byte data) {
    flag_n = (data >> 7) & 0x01;
    flag_v = (data >> 6) & 0x01;
    flag_b = (data >> 4) & 0x01;
    flag_d = (data >> 3) & 0x01;
    flag_i = (data >> 2) & 0x01;
    flag_z = (data >> 1) & 0x01;
    flag_c = data & 0x01;
}

//中断
void interrupt_nmi() {
    if(get_bit(p_reg_2000,7)){
        push16_stack(prgPc);
        push_stack(flag_merge());
        set_i(1);
        prgPc = (read(0xFFFA) & 0xff) | ((read(0xFFFB) & 0xff) << 8);
    }
}

//ppu操作


void render_sprite(int sl,int lineStartIndex) {
    byte spriteHeight = frameSpriteData[sl][0];
    short spritePatternStartAddr = frameSpriteData[sl][1] ? 0x1000:0;
    if(spriteHeight != 0){
        byte bgColorIndex = p_read(0x3F00);
        short *palette = palettes[bgColorIndex & 0xff];
        //获取内存中的精灵数据
        for (int i = 0; i < 256; i += 4) {
            short y = (p_spr_ram[i]&0xff)+1;
            short patternIndex = (short) (p_spr_ram[i+1]&0xff);
            //子图形数据
            byte attributeData = p_spr_ram[i+2];
            //背景层级
            byte backgroundPriority = (attributeData>>5)&1;
            //图案垂直翻转
            byte vFlip = (attributeData>>7)&1;
            //图案水平翻转
            byte hFlip = (attributeData>>6)&1;
            if(sl >= y && sl < y + spriteHeight) {
                byte sprX = p_spr_ram[i+3]&0xff;
                int offset = sl - y;
                //垂直翻转
                if(vFlip == 1){
                    offset = spriteHeight-offset-1;
                }
                //获取图案地址
                int spritePatternAddr = spritePatternStartAddr + patternIndex * 16 + offset;
                if(spriteHeight == 16) {
                    spritePatternAddr = (patternIndex & ~1) * 16 + ((patternIndex & 1) * 0x1000) + (offset >= 8 ? 16 : 0) + (offset & 7);
                }
                byte spritePatternData = p_read(spritePatternAddr);
                //获取图案颜色数据
                byte colorData = p_read(spritePatternAddr + 8);
                byte colorHigh = (attributeData & 0x03)<<2;
                //水平翻转 01234567 -> 76543210
                int x = 0,x2 = 8,x3=1;
                if(hFlip == 1) {
                    x = 7; x2 = -1; x3 = -1;
                }
                int index = sl*256-lineStartIndex*256*120;

                for (;x!=x2; x+=x3) {
                    int colorLow = ((spritePatternData & 0x80)>>7) | (((colorData & 0x80)>>7) << 1);
                    uint16_t bg = render[index + sprX + x];
                    uint16_t sprg = ((palette[0] & 0xf8)<<8)|((palette[1] & 0xfc)<<3)|(palette[2]>>3);
                    if(colorLow && (backgroundPriority == 0||sprg==bg)){
//                            //获取4位颜色
                        uint16_t colorAddr = 0x3f10 | colorHigh | colorLow;
                        if(colorAddr != 0x3f10){
                            short *sprite = palettes[p_read(colorAddr)];
                            uint16_t sprg_color = ((sprite[0] & 0xf8)<<8)|((sprite[1] & 0xfc)<<3)|(sprite[2]>>3);
                            render[index + sprX + x] = sprg_color;
                        }
                    }
                    spritePatternData<<=1;
                    colorData<<=1;
                }
            }
        }
    }
}

void render_name_table(int lineStartIndex){
    byte bgColorIndex = p_read(0x3F00)&0xff;
    for (int line=lineStartIndex*120;line<(lineStartIndex+1)*120;line++){
        byte fine_x = frameData[line][1];
        byte fine_y = (frameData[line][0] >> 12) & 7;
        short nameTableAddress  = 0x2000 | (frameData[line][0] & 0xFFF);
        short patternStartAddr = frameData[line][2];
        int baseIndex1 = line * 256 - fine_x;
        for (int i=0;i<32;i++) {
            //指示哪个tile
            byte coarse_x = nameTableAddress&0x1F;
            byte coarse_y = (nameTableAddress>>5)&0x1F;
            //1 读取name table数据,其实就是Tile图案表索引  (图案+颜色 = 8字节+8字节=16字节)
            byte nameTableData = p_read(nameTableAddress);
            //2 读取图案,图案表起始地址+索引+具体渲染的8字节中的第几字节
            int patternAddress = patternStartAddr + (nameTableData&0xff) * 16 + fine_y;
            //图案表数据
            byte patternData = p_read(patternAddress);
            //图案表颜色数据
            byte colorData = p_read(patternAddress + 8);
            //取颜色高两位,属性表数据64byte,每32*32像素一个字节,每32条扫描线占用8字节
            int attributeOffset = ((coarse_y & 2) ? 4 : 0) + ((coarse_x & 2)? 2 : 0);
            int attributeAddress = 0x23C0 | (nameTableAddress & 0x0C00) | ((coarse_y>>2)<<3) | (coarse_x >> 2);
            byte pchb = (p_read(attributeAddress)>>attributeOffset)&3;
            //合并 取最终4位颜色
            int baseIndex = baseIndex1+i*8;
            for (int j=0; j<8; j++) {
                int pclb = ((get_bit(colorData,7 - j)<<1)&3) | (get_bit(patternData,7 - j)&1);
                int index = baseIndex + j;
                int paletteIndex = bgColorIndex;
                if(pclb) {
                    int colorAddr = 0x3f00 + (pchb<<2|(pclb&0x3));
                    paletteIndex = p_read(colorAddr);
                }
                short *pixels = palettes[paletteIndex];
                render[index-lineStartIndex*256*120] = ((pixels[0] & 0xf8)<<8)|((pixels[1] & 0xfc)<<3)|(pixels[2]>>3);
            }
            // if coarse X == 31 (coarseX的最大值就是31即11111B,所以到最大值了要切换到下一个nametable)
            if ((nameTableAddress & 0x1F) == 0x1F) {
                nameTableAddress = (nameTableAddress & ~0x1f) ^ 0x400;
            } else {
                nameTableAddress++;
            }
        }

        render_sprite(line,lineStartIndex);

