wstars1994/nes-simulator/nes_c_stm32/Core/Src/nes.c
    }
}

void renderSprite(int sl) {
    //获取精灵高度
    byte spriteHeight = get_bit(p_reg_2000,5) == 0?8:16;
    short spritePatternStartAddr = get_bit(p_reg_2000,3) ? 0x1000:0;
    //获取内存中的精灵数据
    for (int i = 0; i < 256; i += 4) {
        short y = (short) ((p_spr_ram[i]&0xff)+1);
        short patternIndex = (short) (p_spr_ram[i+1]&0xff);
        //子图形数据
        byte attributeData = p_spr_ram[i+2];
        //图案垂直翻转
        byte vFlip = (byte) ((attributeData>>7)&1);
        if(sl >= y && sl < y + spriteHeight) {
            //渲染
            frameSpriteData[sl][0] = spriteHeight;
            frameSpriteData[sl][1] = get_bit(p_reg_2000,3);
            int offset = sl - y;
            //垂直翻转
            if(vFlip == 1){
                offset = spriteHeight-offset-1;
            }
            //获取图案地址
            int spritePatternAddr = spritePatternStartAddr + patternIndex * 16 + offset;
            if(spriteHeight == 16) {
                spritePatternAddr = (patternIndex & ~1) * 16 + ((patternIndex & 1) * 0x1000) + (offset >= 8 ? 16 : 0) + (offset & 7);
            }
            byte spritePatternData = p_read(spritePatternAddr);
            //获取图案颜色数据
            byte colorData = p_read(spritePatternAddr + 8);
            //命中非透明背景 sprite0 hit
            if(i==0&&spritePatternData+colorData!=0) {
                set_bit(&p_reg_2002,1,6);
            }
        }
    }
}





void render_name_table2(int scanLineIndex){
    frameData[scanLineIndex][0] = p_vram_addr;
    frameData[scanLineIndex][1] = p_scroll_x;
    frameData[scanLineIndex][2] = get_bit(p_reg_2000,4)?0x1000:0;
}
void ppu_render(int line) {
    //渲染背景
    if(showBg()) {
        render_name_table2(line);
    }
    //渲染精灵
    if(showSpr()) {
        renderSprite(line);
    }
}
//执行指令
byte cpu_cycle = 113;
uint8_t stop = 1;

void exec_instruction() {
    cpu_cycle = 113;
    byte data,data2,data3;
    byte addr;
    int abs_data = 0;
    while (cpu_cycle >= 0) {
        byte opc = read_program(prgPc++);
//        printf("PC:[%06d] | CYC:[%03d] | PC:[%X] | OPC:[%02X] | R:[A:%02X X:%02X Y:%02X S:%02X] | F:[N:%d V:%d B:%d D:%d I:%d Z:%d C:%d]",
//                ++count,
//                cpu_cycle,
//                (prgPc-1)&0xFFFF,
//                 opc&0xFF,
//                c_reg_a&0xFF,c_reg_x&0xFF,c_reg_y&0xFF,c_reg_s&0xFF,
//                flag_n,flag_v,flag_b,flag_d,flag_i,flag_z,flag_c);
        switch (opc&0xFF) {
            case 0x78:
                set_i(1);
                cpu_cycle-=2;
                break;
            case 0xD8:
                set_d(0);
                cpu_cycle-=2;
                break;
            case 0xA9:
                ams_immed(&c_reg_a);
                set_nz(c_reg_a);
                cpu_cycle-=2;
                break;
            case 0x8D:
                abs_data = ams_abs();
                write(abs_data, c_reg_a);
                cpu_cycle-=4;
                break;
            case 0xA2:
                ams_immed(&c_reg_x);
                set_nz(c_reg_x);
                cpu_cycle-=2;
                break;
            case 0x9A:
                c_reg_s = c_reg_x;
                cpu_cycle-=2;
                break;
            case 0xAD:
                c_reg_a = read(ams_abs());
                set_nz(c_reg_a);
                cpu_cycle-=4;
                break;
            case 0x10:
                data = read_program(prgPc++);
                if (flag_n == 0) {
                    cpu_cycle -= 2 + ((prgPc & 0xff00) == ((prgPc + data) & 0xff00) ? 1 : 2);
                    prgPc += data;
                    break;
                }
                cpu_cycle -= 2;
                break;
            case 0xA0:
                ams_immed(&c_reg_y);
                set_nz(c_reg_y);
                cpu_cycle -= 2;
                break;
            case 0xBD:
                abs_data = ams_abs_x(c_reg_x);;
                c_reg_a = read(abs_data);
                set_nz(c_reg_a);
                cpu_cycle -= 4;
                break;
            case 0xC9:
                data = read_program(prgPc++);
                ams_cmp(data);
                cpu_cycle -= 2;
                break;
            case 0xB0:
                data = read_program(prgPc++);
                if(flag_c) {
                    cpu_cycle -= 2 + ((prgPc & 0xff00) == ((prgPc + data) & 0xff00) ? 1 : 2);
                    prgPc += data;
                    break;
                }
                cpu_cycle -= 2;
                break;
            case 0xCA:
                c_reg_x -= 1;
                set_nz(c_reg_x);
                cpu_cycle -= 2;
                break;
            case 0xD0:
                data = read_program(prgPc++);
                if(flag_z == 0) {
                    cpu_cycle -= 2 + ((prgPc & 0xff00) == ((prgPc + data) & 0xff00) ? 1 : 2);
                    prgPc += data;
                    break;
                }
                cpu_cycle -= 2;
                break;
                //JSR
            case 0x20:
                abs_data = ams_abs();
                push16_stack(prgPc - 1);
                prgPc = abs_data;
                cpu_cycle -= 6;
                break;
            case 0x85:
                cpu_cycle -= st_x(read_program(prgPc++)&0xff,c_reg_a);
                break;
            case 0x86:
                cpu_cycle -= st_x(read_program(prgPc++)&0xff,c_reg_x);
                break;
                //CPX
            case 0xE0:
                ams_cpx(read_program(prgPc++));
                cpu_cycle -= 2;
                break;
                //STA_INDIRECT_Y
            case 0x91:
                write(indirect_y(),c_reg_a);
                cpu_cycle -= 6;
                break;
            case 0x88:
                c_reg_y--;
                set_nz(c_reg_y);
                cpu_cycle -= 2;
                break;
                //CPY
            case 0xC0:
                data = read_program(prgPc++);
                ams_cpy(data);
                cpu_cycle -= 2;
                break;
                //RTS
            case 0x60:
                prgPc = pop16_stack();
                prgPc+=1;
                cpu_cycle -= 6;
                break;
                //BIT_ABS
            case 0x2C:
                data = read(ams_abs());
                set_n(data);
                set_v((data>>6)&1);
                set_z(c_reg_a & data);
                cpu_cycle -= 4;
                break;
                //STA_ABS_Y
            case 0x99:
                st_x(ams_abs_x(c_reg_y),c_reg_a);
                cpu_cycle -= 5;
                break;
                //INY
            case 0xC8:
                c_reg_y+=1;
                set_nz(c_reg_y);
                cpu_cycle -= 2;
                break;
                //ORA
            case 0x09:
                data = read_program(prgPc++);
                ams_ora(data);
                cpu_cycle -= 2;
                break;
                //AND
            case 0x29:
                data = read_program(prgPc++);
                c_reg_a &= data;
                set_nz(c_reg_a);
                cpu_cycle -= 2;
                break;
                //TXA
            case 0x8A:
                c_reg_a = c_reg_x;
                set_nz(c_reg_a);
                cpu_cycle -= 2;
                break;
                //JMP_ABS
            case 0x4C:
                prgPc = ams_abs();
                cpu_cycle -= 3;
                break;
                //INC_ABS
            case 0xEE:
                abs_data = ams_abs();
                data = (read(abs_data) + 1)&0xff;
                write(abs_data, data);
                set_nz(data);
                cpu_cycle -= 6;
                break;
                //执行到AC前会触发NMI
                //LDY_ABS
            case 0xAC:
                c_reg_y = read(ams_abs());
                set_nz(c_reg_y);
                cpu_cycle-= 4;
                break;
                //LDX_ABS
            case 0xAE:
                c_reg_x = read(ams_abs());
                set_nz(c_reg_x);
                cpu_cycle-= 4;
                break;
                //LDA_INDIRECT_Y
            case 0xB1:
                c_reg_a = indirect_y();
                set_nz(c_reg_a);
                cpu_cycle-= 5;
                break;
                //LDX_ABS_Y
            case 0xBE:
                c_reg_x = read(ams_abs_x(c_reg_y));
                set_nz(c_reg_x);
                cpu_cycle-= 4;
                break;
                //STA_ABS_X
            case 0x9D:
                abs_data = ams_abs_x(c_reg_x);
                write(abs_data, c_reg_a);
                cpu_cycle-= 5;
                break;
                //LSR
            case 0x4A:
                flag_c = c_reg_a&1;
                c_reg_a = (c_reg_a&0xff) >> 1;
                set_nz(c_reg_a);
                cpu_cycle-= 2;
                break;
                //TAX
            case 0xAA:
                c_reg_x = c_reg_a;
                set_nz(c_reg_x);
                cpu_cycle-=2;
                break;
                //PHA
            case 0x48:
                push_stack(c_reg_a);
                cpu_cycle-=3;
                break;
                //ORA_ZERO
            case 0x05:
                data = read_program(prgPc++);
                c_reg_a |= read(data&0xFF);
                set_nz(c_reg_a);
                cpu_cycle-=3;
                break;
                //PLA
            case 0x68:
                c_reg_a = pop8_stack();
                set_nz(c_reg_a);
                cpu_cycle-=4;
                break;
                //ROL
            case 0x2A:
                data = c_reg_a;
                c_reg_a = (data << 1) | flag_c;
                flag_c = (data >> 7) & 1;
                set_nz(c_reg_a);
                cpu_cycle-=2;
                break;
                //AND_ABS_X
            case 0x3D:
                abs_data = ams_abs_x(c_reg_x);
                c_reg_a &= read(abs_data);
                set_nz(c_reg_a);
                cpu_cycle-=4;
                break;
                //BEQ
            case 0xF0:
                data = read_program(prgPc++);
                cpu_cycle-= ams_branch(data,flag_z);
                break;
                //INX
            case 0xE8:
                c_reg_x += 1;
                set_nz(c_reg_x);
                cpu_cycle-=2;
                break;
                //SEC
            case 0x38:
                flag_c = 1;
                cpu_cycle-=2;
                break;
                //SBC_ABS_Y
            case 0xF9:
                ams_sbc(read(ams_abs_x(c_reg_y)));
                cpu_cycle-=4;
                break;
                //BCC
            case 0x90:
                data = read_program(prgPc++);
                cpu_cycle-= ams_branch(data,flag_c==0);
                break;
                //DEC_ABS
            case 0xCE:
                abs_data = ams_abs();
                data = read(abs_data)-1;
                write(abs_data, data);
                set_nz(data);
                cpu_cycle-=6;
                break;
                //INC_ZERO
            case 0xE6:
                data = read_program(prgPc++);
                data2 = read(data&0xFF)+1;
                write(data&0xFF,data2);
                set_nz(data2);
                cpu_cycle-=5;
                break;
                //EOR_ZERO
            case 0x45:
                data = read( read_program(prgPc++)&0xFF);
                ams_eor_a(data);
                cpu_cycle-=3;
                break;
                //CLC
            case 0x18:
                flag_c = 0;
                cpu_cycle-=2;
                break;
                //ROR_ABS_X
            case 0x7E:
                abs_data = ams_abs_x(c_reg_x);
                data = read(abs_data);
                data2 = ((data & 0xff) >> 1) | (flag_c << 7);
                flag_c=data&1;
                set_nz(data2);
                write(abs_data,data2);
                cpu_cycle-=7;
                break;
                //ASL_A
            case 0x0A:
                flag_c = (c_reg_a >> 7) & 1;
                c_reg_a <<= 1;
                set_nz(c_reg_a);
                cpu_cycle-= 2;
                break;
                //TAY
            case 0xA8:
                c_reg_y = c_reg_a;
                set_nz(c_reg_y);
                cpu_cycle-= 2;
                break;
                //JMP_INDIRECT
            case 0x6C:
                abs_data = ams_abs();
                byte low = read(abs_data);
                prgPc = concat16(low,read(abs_data+1));
                cpu_cycle-=5;
                break;
                //LDA_ABS_Y
            case 0xB9:
                abs_data = ams_abs_x(c_reg_y);
                c_reg_a = read(abs_data);
                set_nz(c_reg_a);
                cpu_cycle-=4;
                break;
                //ADC_ABS
            case 0x6D:
                data = read(ams_abs());
                ams_adc(data);
                cpu_cycle-=4;
                break;
                //ADC
            case 0x69:
                data = read_program(prgPc++);
                ams_adc(data);
                cpu_cycle-=2;
                break;
                //STY_ABS
            case 0x8C:
                write(ams_abs(),c_reg_y);
                cpu_cycle-=3;
                break;
                //LDA_ZERO
            case 0xA5:
                data = read_program(prgPc++);
                c_reg_a = read(data&0xFF);
                set_nz(c_reg_a);
                cpu_cycle-=3;
                break;
                //RTI
            case 0x40:
                flag_set(pop8_stack());
                prgPc = pop16_stack();
                cpu_cycle-=6;
                break;
                //DEC_ZERO
            case 0xC6:
                data = read_program(prgPc++) & 0xFF;
                data2 = read(data) - 1;
                write(data,data2);
                set_nz(data2);
                cpu_cycle-=5;
                break;
                //TYA
            case 0x98:
                c_reg_a = c_reg_y;
                set_nz(c_reg_a);
                cpu_cycle-=2;
                break;
                //ADC_ZERO
            case 0x65:
                data = read(read_program(prgPc++)&0xFF);
                ams_adc(data);
                cpu_cycle-=3;
                break;
                //LDX_ZERO
            case 0xA6:
                c_reg_x = read(read_program(prgPc++)&0xFF);
                set_nz(c_reg_x);
                cpu_cycle-=3;
                break;
                //STX_ABS
            case 0x8E:
                abs_data = ams_abs();
                write(abs_data,c_reg_x);
                cpu_cycle-=4;
                break;
                //BMI
            case 0x30:
                data = read_program(prgPc++);
                cpu_cycle-= ams_branch(data,flag_n);
                break;
                //ADC_ABS_Y
            case 0x79:
                abs_data = ams_abs_x(c_reg_y);
                ams_adc(read(abs_data));
                cpu_cycle-= 4;
                break;
                //SBC
            case 0xE9:
                data = read_program(prgPc++);
                ams_sbc(data);
                cpu_cycle-=2;
                break;
                //STY_ZERO
            case 0x84:
                write(read_program(prgPc++)&0xFF,c_reg_y);
                cpu_cycle-=3;
                break;
                //BIT_ZERO
            case 0x24:
                data = read(read_program(prgPc++)&0xFF);
                set_n(data);
                set_v((data>>6)&1);
                set_z(c_reg_a & data);
                cpu_cycle-=3;
                break;
                //LDY_ZERO
            case 0xA4:
                data = read(read_program(prgPc++)&0xFF);
                c_reg_y = data;
                set_nz(c_reg_y);
                cpu_cycle-=3;
                break;
                //CMP_ABS
            case 0xCD:
                ams_cmp(read(ams_abs()));
                cpu_cycle-=4;
                break;
                //CMP_ABS_Y
            case 0xD9:
                ams_cmp(read(ams_abs_x(c_reg_y)));
                cpu_cycle-=4;
                break;
                //EOR
            case 0x49:
                c_reg_a ^= read_program(prgPc++);
                set_nz(c_reg_a);
                cpu_cycle-= 2;
                break;
                //ROL_ZERO
            case 0x26:
                data = read(read_program(prgPc++)&0xFF);
                data2 = (data << 1) | flag_c;
                flag_c = (data >> 7) & 1;
                set_nz(data2);
                write(read_program(prgPc-1)&0xFF,data2);
                cpu_cycle-= 5;
                break;
                //LSR_ZERO
            case 0x46:
                data = read_program(prgPc++)&0xFF;
                data3 = read(data&0xff);
                data2 = (data3 & 0xff) >> 1;
                flag_c = data3&1;
                set_nz(data2);
                write(data,data2);
                cpu_cycle-= 5;
                break;
                //LDY_ABS_X
            case 0xBC:
                data = read( ams_abs_x(c_reg_x));
                c_reg_y = data;
                set_nz(c_reg_y);
                cpu_cycle-=4;
                break;
                //DEC_ABS_X
            case 0xDE:
                abs_data = ams_abs_x(c_reg_x);
                data = read( abs_data)-1;
                write(abs_data,data);
                set_nz(data);
                cpu_cycle-=7;
                break;
                //LSR_ABS
            case 0x4E:
                ams_lsr(ams_abs());
                cpu_cycle-=6;
                break;
                //ROR_A
            case 0x6A:
                data = ((c_reg_a & 0xff) >> 1) | (flag_c << 7);
                flag_c=c_reg_a&1;
                ams_lda(data);
                cpu_cycle-=2;
                break;
                //ROL_ABS
            case 0x2E:
                abs_data = ams_abs();
                data = read(abs_data);
                data2 = (data << 1) | flag_c;
                flag_c=(data >> 7) & 1;
                set_nz(data2);
                write(abs_data,data2);
                cpu_cycle-=6;
                break;
                //CMP_ZERO
            case 0xC5:
                data = read(read_program(prgPc++)&0xFF);
                ams_cmp(data);
                cpu_cycle-=3;
                break;
                //ORA_ABS
            case 0x0D:
                c_reg_a |= read(ams_abs());
                set_nz(c_reg_a);
                cpu_cycle-=2;
                break;
                //NOP
            case 0xEA:
                cpu_cycle-=2;
                break;
                //LDA_ZERO_X
            case 0xB5:
                data = read(ams_zero(read_program(prgPc++),c_reg_x));
                ams_lda(data);
                cpu_cycle-=4;
                break;
                //STA_ZERO_X
            case 0x95:
                write(ams_zero(read_program(prgPc++),c_reg_x), c_reg_a);
                cpu_cycle-=4;
                break;
                //SBC_ABS
            case 0xED:
                ams_sbc(read(ams_abs()));
                cpu_cycle-=4;
                break;
                //CMP_ZERO_X
            case 0xD5:
                ams_cmp(read(ams_zero(read_program(prgPc++),c_reg_x)));
                cpu_cycle-=4;
                break;
                //SBC_ZERO_X
            case 0xF5:
                ams_sbc(read(ams_zero(read_program(prgPc++),c_reg_x)));
                cpu_cycle-=4;
                break;
                //AND_ABS_Y
            case 0x39:
                c_reg_a &= read(ams_abs_x(c_reg_y));
                set_nz(c_reg_a);
                cpu_cycle-=4;
                break;
                //ASL_ABS
            case 0x0E:
                abs_data = ams_abs();
                data = read(abs_data);
                flag_c=(data >> 7) & 1;
                data2 = data << 1;
                set_nz(data2);
                write(abs_data,data2);
                cpu_cycle-=6;
                break;
                //AND_ABS
            case 0x2D:
                abs_data = ams_abs();
                c_reg_a &= read(abs_data);
                set_nz(c_reg_a);
                cpu_cycle-=4;
                break;
                //ADC_ABS_X
            case 0x7D:
                abs_data = ams_abs_x(c_reg_x);
                ams_adc(read(abs_data));
                cpu_cycle-=4;
                break;
                //CMP_ABS_X
            case 0xDD:
                abs_data = ams_abs_x(c_reg_x);
                ams_cmp(read(abs_data));
                cpu_cycle-=2;
                break;
                //ADC_ZERO_X
            case 0x75:
                abs_data = ams_zero(read_program(prgPc++),c_reg_x);
                ams_adc(read(abs_data));
                cpu_cycle-=2;
                break;
                //SBC_ZERO
            case 0xE5:
                data = read(read_program(prgPc++)&0xff);
                ams_sbc(data);
                cpu_cycle-=3;
                break;
                //AND_ZERO
            case 0x25:
                data = read(read_program(prgPc++)&0xff);
                ams_and(data);
                cpu_cycle-=3;
                break;
                //PLP
            case 0x28:
                flag_set(pop8_stack());
                cpu_cycle-=4;
                break;
                //ASL_ZERO
            case 0x06:
                ams_asl(read_program(prgPc++)&0xff);
                cpu_cycle-=5;
                break;
                //AND_INDIRECT_Y
            case 0x31:
                ams_and(indirect_y());
                cpu_cycle-=5;
                break;
                //LDY_ZERO_X
            case 0xB4:
                addr = read_program(prgPc++);
                int data = ams_zero(addr,c_reg_x);
                data2 = read(data);
                c_reg_y = data2;
                set_nz(c_reg_y);
                cpu_cycle-=4;
                break;
                //EOR_ABS
            case 0x4D:
                abs_data = ams_abs();
                data = read(abs_data);
                flag_c=(data >> 7) & 1;
                data2 = data << 1;
                set_nz(data2);
                write(addr, data2);
                cpu_cycle-=5;
                break;
                //TSX
            case 0xBA:
                c_reg_x = c_reg_s;
                set_nz(c_reg_x);
                cpu_cycle-=2;
                break;
                //DEC_ZERO_X
            case 0xD6:
                data = read_program(prgPc++);
                int addr = ams_zero(data,c_reg_x);
                data2 = read(addr) - 1;
                write(addr,data2);
                set_nz(data2);
                cpu_cycle-=6;
                break;
                //EOR_ZERO_X
            case 0x55:
                addr = read_program(prgPc++);
                ams_eor_a(read(ams_zero(addr, c_reg_x)));
                cpu_cycle-=4;
                break;
                //AND_ZERO_X
            case 0x35:
                addr = read_program(prgPc++);
                ams_and(read(ams_zero(addr, c_reg_x)));
                cpu_cycle-=4;
                break;
                //STY_ZERO_X
            case 0x94:
                addr = read_program(prgPc++);
                data = ams_zero(addr, c_reg_x);
                write(data,c_reg_y);
                cpu_cycle-=4;
                break;
                //INC_ZERO_X
            case 0xF6:
                addr = ams_zero(read_program(prgPc++), c_reg_x);
                data = read(addr) + 1;
                write(addr, data);
                set_nz(data);
                cpu_cycle-=6;
                break;
                //ORA_ZERO_X
            case 0x15:
                addr = read_program(prgPc++);
                ams_ora(read(addr));
